---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.AddingOtherConnectedMembersToSystem
source: html/133f856d-40c2-69f3-85c3-09e76d765ce4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.AddingOtherConnectedMembersToSystem Property

"You have selected elements that are connected to other elements. These elements will also be added to the System."

## Syntax (C#)
```csharp
public static FailureDefinitionId AddingOtherConnectedMembersToSystem { get; }
```